app/Controllers/Users.php

  public function update($id = null) {

    $user = $this->model->find($id);

    if (!$user) {
      return $this->failNotFound('Usuário não encontrado');
    }

    $data = $this->request->getJSON(true);

    if (!$data) {
      return $this->failValidationErrors('Dados inválidos');
    }

    if (!$this->model->update($id, $data)) {
---
UPDATE `users` SET `name` = 'Novo Nome', `email` = 'novo@email.com', `updated_at` = '2025-05-26 18:03:10'
WHERE `users`.`id` IN ('18')

  public function delete($id = null) {

    if ($id === null) {
      return $this->failValidationErrors('ID do usuário é obrigatório para exclusão.');
    }

    $user = $this->model->find($id);

    if (!$user) {
      return $this->failNotFound('Usuário não encontrado');
    }

    $this->model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('24')